---
kind: other
id: Methods.T:Autodesk.Revit.DB.CeilingAndFloor
source: html/d32c588b-bdae-edfd-c834-510a38d9f26d.htm
---
# CeilingAndFloor Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.